config.org
:PROPERTIES:
:ID:       677d2cee-3665-43f4-a895-6fe08f11eb9a
:END:
#+title: Minha Configuração do Emacs
#+property: header-args :mkdirp yes

Vamos usar o binding léxico:
#+begin_src emacs-lisp
;;; -*- lexical-binding: t; -*-
#+end_src

* Doom
** Zen
Ver também [[file:lisp/minor/writeroom-mode.el][writeroom-mode]] e [[file:lisp/minor/mixed-pitch.el][mixed-pitch]].
#+begin_src emacs-lisp
(setq +zen-text-scale 0)
#+end_src

* Estético
** Tema
#+begin_src emacs-lisp
(setq doom-theme 'doom-tomorrow-night)
#+end_src
*** Esconder temas

Deixa a seleção menos distrativa, removendo os temas não-doom e os temas da
lista abaixo.

#+begin_src emacs-lisp
(defvar my/custom-themes-exclude
  '(doom-acario-light
    doom-acario-dark
    doom-badger
    doom-dark+
    doom-henna
    doom-homage-white
    doom-Iosvkem
    doom-1337
    doom-molokai
    doom-sourcerer
    doom-peacock
    doom-wilmersdorf
    doom-manegarm
    doom-ephemeral
    doom-nova
    doom-opera
    doom-zenburn
    doom-ayu-mirage
    doom-vibrant
    doom-ir-black
    doom-old-hope
    doom-miramare
    doom-monokai-spectrum
    doom-monokai-ristretto))

(advice-add 'custom-available-themes :filter-return
            (lambda (l)
              (seq-difference
               (seq-filter (lambda (x) (s-prefix? "doom-" (symbol-name x))) l)
               my/custom-themes-exclude #'eq)))
#+end_src
** Faces
*** Fontes

#+begin_src emacs-lisp
(setq doom-font                (font-spec :family "Iosevka" :size 22)
      doom-variable-pitch-font (font-spec :family "Overpass" :size 19 :weight 'light)
      doom-serif-font          (font-spec :family "IBM Plex Mono" :weight 'light))
      ;; doom-unicode-font        (font-spec :family "JuliaMono" :weight 'normal))

;; Colocamos uma ordem de prioridade para tentar ter todos os unicodes e emojis.
(add-hook! 'after-setting-font-hook
  (set-fontset-font t 'unicode "JuliaMono")
  (set-fontset-font t 'unicode "Twemoji" nil 'append))
#+end_src

*** Código (prog)
Deixamos os comentários itálicas, e os ~keywords~ oblíquos.

#+begin_src emacs-lisp
(custom-set-faces!
  '(font-lock-comment-face :slant italic)
  '(font-lock-keyword-face :slant oblique))
#+end_src

*** @Yasnippet
#+begin_src emacs-lisp
(custom-set-faces!
  `(yas-field-highlight-face
    :inherit nil
    :background ,(doom-blend "#99f056" (doom-color 'bg) 0.1)))
#+end_src
*** @Org
#+begin_src emacs-lisp
(custom-set-faces!
  `(org-latex-and-related :foreground ,(cadr (assq 'cyan doom-themes--colors)) :weight normal))
(custom-theme-set-faces! 'doom-flatwhite
  `(org-latex-and-related :foreground nil :background ,(cadr (assq 'fw-green-blend doom-themes--colors)) :weight normal))
#+end_src
*** Ícones
Ajusta o tamanho dos ícones.

#+begin_src emacs-lisp
(setq all-the-icons-scale-factor 0.88)
#+end_src

** Modeline

#+begin_src elisp :tangle tangle/minor/doom-modeline.el
;;; tangle/minor/doom-modeline.el -*- lexical-binding: t; -*-

(doom-modeline-def-segment buffer-name
  "Display the current buffer's name, without any other information."
  (concat
    (doom-modeline-spc)
    (doom-modeline--buffer-name)))

(doom-modeline-def-segment pdf-icon
  "PDF icon from all-the-icons."
  (concat
    (doom-modeline-spc)
    (doom-modeline-icon 'octicon "file-pdf" nil nil
                        :face (if (doom-modeline--active)
                                  'all-the-icons-red
                                'mode-line-inactive)
                        :v-adjust 0.02)))

(defun doom-modeline-update-pdf-pages ()
  "Update PDF pages."
  (setq doom-modeline--pdf-pages
        (let ((current-page-str (number-to-string (eval `(pdf-view-current-page))))
              (total-page-str (number-to-string (pdf-cache-number-of-pages))))
          (concat
            (propertize
              (concat (make-string (- (length total-page-str) (length current-page-str)) 32)
                    " P" current-page-str)
              'face 'mode-line)
            (propertize (concat "/" total-page-str) 'face 'doom-modeline-buffer-minor-mode)))))

(doom-modeline-def-segment pdf-pages
  "Display PDF pages."
  (if (doom-modeline--active) doom-modeline--pdf-pages
    (propertize doom-modeline--pdf-pages 'face 'mode-line-inactive)))

(doom-modeline-def-modeline 'pdf
  '(bar window-number pdf-pages pdf-icon buffer-name)
  '(misc-info matches major-mode process vcs))

#+end_src

#+begin_src emacs-lisp
(custom-set-faces!
  '(mode-line :height 110 :family "JuliaMono")
  '(mode-line-inactive :height 110 :family "JuliaMono")
  '(doom-modeline-buffer-modified :foreground "#c63")
  '(doom-modeline-info :foreground "white"))
(setq! +modeline-height 26)
#+end_src

** Divisores de janelas

#+begin_src emacs-lisp
(setq window-divider-default-bottom-width 2   ; default is 1
      window-divider-default-right-width  2)  ; default is 1
#+end_src

** Dashboard
*** Estético

Pequenas modificações ao dashboard:

#+begin_src emacs-lisp
;; Desabilita o "benchmark"
(remove-hook 'window-setup-hook #'doom-display-benchmark-h)
#+end_src

*** Banner

#+begin_src emacs-lisp
(setq +doom-dashboard-functions '(doom-dashboard-widget-shortmenu
                                  doom-dashboard-widget-loaded))
#+end_src

#+RESULTS:
: ~/.doom.d/logo.png

A fonte padrão é itálica e deixa os acrobatas tortos, vamos resolver isso:

#+begin_src emacs-lisp
(custom-set-faces!
  '(doom-dashboard-banner
    :inherit font-lock-comment-face
    :slant normal))
#+end_src

* Minha biblioteca
** Pasta-bibioteca

Com algumas bibliotecas externas, por exemplo.

#+begin_src emacs-lisp
(let ((default-directory "~/.doom.d/lisp/lib"))
  (normal-top-level-add-subdirs-to-load-path))
(add-load-path! "lisp/lib")
#+end_src

** Funções (não interativas)
*** Conselhos
Para desabilitar as mensagens chatas:
#+begin_src emacs-lisp
(defun advice--inhibit-message (f &rest r) (let ((inhibit-message t)) (apply f r)))
#+end_src

*** Checa se objeto é uma lista de strings
#+begin_src emacs-lisp
(defun string-list-p (x) (and (listp x) (--all? (stringp it) x)))
#+end_src

** Funções (interativas)
*** Excluir todos os conselhos
#+begin_src emacs-lisp
(defun advice-unadvice (sym)
  "Remove all advices from symbol SYM."
  (interactive "aFunction symbol: ")
  (advice-mapc (lambda (advice _props) (advice-remove sym advice)) sym))
#+end_src

* Emacs em geral
** Scroll
#+begin_src emacs-lisp
(setq mouse-wheel-scroll-amount '(1 ((shift) . 1)) ;; one line at a time
      mouse-wheel-progressive-speed nil ;; don't accelerate scrolling
      confirm-kill-emacs nil
      scroll-step 1) ;; keyboard scroll one line at a time
#+end_src

** Edição de texto
*** Atalhos
