config.tex

\subsection{Edição de texto}
\label{sec:org3cc2396}
\subsubsection{Atalhos}
\label{sec:org36a08b4}
\subsubsection{Variáveis}
\label{sec:orgeaff0ac}
\begin{verbatim}
(setq-default fill-column 80)

(setq company-idle-delay 0.01
      company-minimum-prefix-length 4)

(setq mouse-drag-and-drop-region t
      mouse-drag-and-drop-region-cut-when-buffers-differ t
      mouse-drag-and-drop-region-show-tooltip nil)

(setq default-input-method "TeX")
\end{verbatim}

Deixa o \texttt{text-scale-mode} mais devagar.

\begin{verbatim}
(setq text-scale-mode-step 1.05)
\end{verbatim}
\subsubsection{Salvando}
\label{sec:org403bc5c}
Desabilita a mensagem de salvamento.

\begin{verbatim}
(advice-add 'save-buffer :around #'advice--inhibit-message)
\end{verbatim}

\subsubsection{Piscar o cursor\hfill{}\textsc{ARCHIVE}}
\label{sec:org371e6dc}
\subsubsection{Abbrev}
\label{sec:orgb99a92e}
Meu deus, como eu passei tanto tempo (4 meses) sem saber da existência
desta coisa MARAVILHOSA??? É INCRÍVEL!!!!

\begin{verbatim}
(add-hook! 'text-mode-hook
           (abbrev-mode +1))

(setq abbrev-file-name (concat doom-private-dir "abbrev_defs"))
\end{verbatim}

\subsection{Pesquisa \& regex}
\label{sec:orgb6e2528}
\begin{verbatim}
(pcre-mode +1)
\end{verbatim}

\subsection{Menu de contexto}
\label{sec:org8172c01}

Retirado de:
\href{https://somecallmespace.com/emacs-context-menu.html}{some call me Space | Emacs Context Menu}

\begin{verbatim}
(require 'context-menu)
(map! [mouse-3] 'my-context-menu)
\end{verbatim}

\subsection{Popups}
\label{sec:org9f4e53b}
\begin{verbatim}
(setq +popup-defauts
      '(:side bottom
        :height 0.3
        :width 130
        :quit t
        :select ignore
        :ttl 5))

(setq +popup-default-alist
      '((window-height . 0.3)
        (reusable-frames . visible)))

\end{verbatim}

\subsection{Outros\hfill{}\textsc{completion}}
\label{sec:org07835dd}

\begin{verbatim}
(remove-hook! '(org-mode-hook text-mode-hook) #'flyspell-mode)

(setq vterm-shell "zsh"
      delete-by-moving-to-trash t
      mouse-autoselect-window nil)
\end{verbatim}

\subsection{Maximizar a janela?}
\label{sec:org548ce9e}

Maximizar a janela ao iniciar?

\begin{verbatim}
;; (add-to-list 'initial-frame-alist '(fullscreen . maximized))
\end{verbatim}

\section{Configurações de pacotes}
\label{sec:orgaf2d49b}
\subsection{{\bfseries\sffamily TODO} Use-packages (temporário)}
\label{sec:orgfc51f71}

Primeiro, alguns pacotes configurados com o \texttt{use-package}:

\begin{verbatim}
(use-package prettify-utils
  :after (org latex))

(use-package tree-sitter
  :after doom-first-file-hook
  :config
  (require 'tree-sitter-langs)
  (global-tree-sitter-mode)
  (add-hook 'tree-sitter-after-on-hook #'tree-sitter-hl-mode))

(use-package scroll-on-drag
  :bind ([down-mouse-2] . #'scroll-on-drag))

(defun yas-get-snippet (mode key)
       (yas--fetch (yas--get-snippet-tables mode) key))

(use-package laas
  :commands (laas-mode))

(use-package lean4-mode
  :commands (lean4-mode))

(use-package mamimo
  :hook ((org-mode latex-mode markdown-mode) . mamimo-mode))
\end{verbatim}

\subsection{{\bfseries\sffamily TODO} Packages.el (temporário)}
\label{sec:org917055a}

Isso é temporário, enquanto eu não organizo o meu antigo arquivo \texttt{packages.el}.
\begin{verbatim}
;; -*- no-byte-compile: t; -*-
;;; $DOOMDIR/packages.el

;; latex
;; (package! latex-preview-pane)
(package! aas :recipe (:host github :repo "ymarco/auto-activating-snippets"))

;; doom
(package! writegood-mode :disable t)
(package! hl-line :disable t)
(package! smooth-scrolling)
(package! scroll-on-drag)
(package! nyan-mode)

;; Tree-sitter
(package! tree-sitter)
(package! tree-sitter-langs)

(package! lsp-treemacs)

(unpin! lsp-mode)
(unpin! company-box)
(unpin! consult)
(unpin! doom-themes)
(unpin! vertico)
(unpin! treemacs)

(package! benchmark-init :recipe (:host github :repo "kekeimiku/benchmark-init-el"))

(package! company-math)
(package! math-symbol-lists)
(package! company-math)
(package! real-auto-save)
\end{verbatim}

\subsection{Major modes}
\label{sec:org4316566}
\subsubsection{Org}
\label{sec:org9dbdc7d}
\begin{enumerate}
\item Variáveis
\label{sec:org94a49b4}
\begin{verbatim}
(setq org-directory "~/Lucas/org"
      org-latex-packages-alist '(("" "tikz" t) ("" "tikz-cd" t))
      org-support-shift-select t
      org-hide-emphasis-markers t
      org-src-window-setup 'plain
      org-highlight-latex-and-related '(native script)
      org-indent-indentation-per-level 1)
\end{verbatim}

\item Gutter
\label{sec:orgdbbfd77}

O \texttt{git-gutter} não funciona bem com o \texttt{org-indent-mode}:

\begin{verbatim}
(push 'org-mode git-gutter:disabled-modes)
\end{verbatim}

\item Configuração
\label{sec:orgabf43ea}
\begin{verbatim}
;;; tangle/major/org.el -*- lexical-binding: t; -*-
(require 'org-src)
(add-to-list 'org-src-block-faces '("latex" (:inherit default :extend t)))

(add-hook! org-mode
    (auto-fill-mode +1)
    (setq-local real-auto-save-interval 0.2)
    (turn-off-smartparens-mode)
    (turn-on-show-smartparens-mode)
    (ws-butler-mode -1)
    (my/org-hide-properties)
    )

(set-popup-rule! "\*Org Src .+\*"
  :size 0.5)

(setq org-preview-latex-default-process 'dvisvgm)
(plist-put org-format-latex-options :scale 1.3)

(add-to-list
 '+company-backend-alist
 '(org-mode (:separate company-math-symbols-latex company-dabbrev company-ispell company-capf)))

(map! :map 'evil-org-mode-map
      :i "C-l" #'flyspell-correct-move)

(after! ox-latex
  (add-to-list 'org-latex-classes
            '("report-noparts"
                "\\documentclass{report}"
                ("\\chapter{%s}" . "\\chapter*{%s}")
                ("\\section{%s}" . "\\section*{%s}")
                ("\\subsection{%s}" . "\\subsection*{%s}")
                ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
                ("\\paragraph{%s}" . "\\paragraph*{%s}")
                ("\\subparagraph{%s}" . "\\subparagraph*{%s}"))))

(map! :mode 'org-mode :g "C-S-s" #'org-latex-export-to-pdf)
\end{verbatim}

\item Hook
\label{sec:orgc17c6dd}

\begin{verbatim}
(auto-fill-mode +1)
(setq-local real-auto-save-interval 0.2)
(turn-off-smartparens-mode)
(turn-on-show-smartparens-mode)
(ws-butler-mode -1)
\end{verbatim}
