config.tex

\item Esconder \texttt{:properties:}
\label{sec:org25d5918}

Roubado do manual do Roam v2 (ou algo assim).

\begin{verbatim}
(defun my/org-hide-properties ()
  "Hide all org-mode headline property drawers in buffer. Could be
slow if it has a lot of overlays."
  (interactive)
  (save-excursion
    (goto-char (point-min))
    (while (re-search-forward
            "^ *:properties:\n\\( *:.+?:.*\n\\)+ *:end:\n" nil t)
      (let ((ov_this (make-overlay (match-beginning 0) (match-end 0))))
        (overlay-put ov_this 'display "")
        (overlay-put ov_this 'hidden-prop-drawer t))))
  (put 'org-toggle-properties-hide-state 'state 'hidden))

(defun my/org-show-properties ()
  "Show all org-mode property drawers hidden by org-hide-properties."
  (interactive)
  (remove-overlays (point-min) (point-max) 'hidden-prop-drawer t)
  (put 'org-toggle-properties-hide-state 'state 'shown))

(defun my/org-toggle-properties ()
  "Toggle visibility of property drawers."
  (interactive)
  (if (eq (get 'org-toggle-properties-hide-state 'state) 'hidden)
      (org-show-properties)
    (org-hide-properties)))
\end{verbatim}

\begin{verbatim}
(my/org-hide-properties)
\end{verbatim}
\end{enumerate}

\subsection{Features}
\label{sec:orgfd9efe5}
\subsubsection{@Org}
\label{sec:org7d93536}
\begin{enumerate}
\item Org-roam
\label{sec:org749418b}

\begin{verbatim}
;;; tangle/feature/org-roam.el -*- lexical-binding: t; -*-
(setq org-roam-directory "~/Lucas/notas")

(defadvice! +org-roam-reuse-windows (&rest r)
  :before #'org-roam-preview-visit
  :before #'org-roam-node-visit
  (when org-roam-buffer-current-node
    (let ((window (get-buffer-window
                    (get-file-buffer
                      (org-roam-node-file org-roam-buffer-current-node)))))
      (when window (select-window window)))))

(defadvice! doom-modeline--buffer-file-name-roam-aware-a (orig-fun)
  :around #'doom-modeline-buffer-file-name ; takes no args
  (if (s-contains-p (expand-file-name org-roam-directory) (or buffer-file-name ""))
      (replace-regexp-in-string
       "\\(?:^\\|.*/\\)\\([0-9]\\{4\\}\\)\\([0-9]\\{2\\}\\)\\([0-9]\\{2\\}\\)[0-9]*-"
       "🢔(\\1-\\2-\\3) "
       (subst-char-in-string ?_ ?  buffer-file-name))
    (funcall orig-fun)))
\end{verbatim}

\item {\bfseries\sffamily TODO} Org-ql
\label{sec:org362604f}
\begin{verbatim}
(package! org-ql)
\end{verbatim}

\item Org-sidebar\hfill{}\textsc{ARCHIVE}
\label{sec:org2cdedca}
\end{enumerate}

\subsubsection{Ispell}
\label{sec:orgaaad1bf}

\begin{verbatim}
(setq ispell-dictionary "pt_BR,en_US"
      ispell-personal-dictionary (concat doom-private-dir ".hunspell-personal"))

(unless (file-exists-p ispell-personal-dictionary)
  (write-region "" nil ispell-personal-dictionary nil 0))
\end{verbatim}

Cria um dicionário multilinguagem com português e inglês.

\begin{verbatim}
(after! ispell
  (ispell-hunspell-add-multi-dic "pt_BR,en_US")
  (ispell-set-spellchecker-params))
\end{verbatim}

\subsubsection{@Projectile}
\label{sec:org88d39a6}
\begin{verbatim}
(after! projectile
    (projectile-register-project-type 'julia '("Project.toml")
                                    :project-file "Project.toml"
                                    :test "julia -e \"using Pkg; Pkg.test()\""))
\end{verbatim}

\subsubsection{{\bfseries\sffamily TODO} Hercules}
\label{sec:org51a57c0}

O Hercules é um ``Hydra automático'': ele deixa alguns keymaps persistentes, até
que uma tecla fora do keymap seja pressionada.

\begin{verbatim}
(package! hercules)
\end{verbatim}

Exemplos:
\begin{verbatim}
(hercules-def
 :toggle-funs #'macrostep-mode
 :keymap 'macrostep-keymap)
 
(define-key <map-symbol> (kbd "<key>") #'macrostep-mode)

(hercules-def
 ;; read further to see why this works
 :toggle-funs #'org-babel-mode
 :keymap 'org-babel-map
 :transient t)
 
;; tweak binding to taste
(define-key org-mode-map (kbd "C-c C-v") #'org-babel-mode)
\end{verbatim}
\subsubsection{Treemacs}
\label{sec:orgcd5b88a}
\begin{enumerate}
\item Ignorar (esconder) algumas coisas
\label{sec:orge446025}

Roubado do tecosaur.

\begin{verbatim}
(defcustom treemacs-file-ignore-extensions
  '("aux" "ptc" "fdb_latexmk" "fls" "synctex.gz" "toc"         ;; LaTeX
    "glg"  "glo"  "gls"  "glsdefs"  "ist"  "acn"  "acr"  "alg" ;; LaTeX - glossary
    "mw"                                                       ;; LaTeX - pgfplots
    "pdfa.xmpi")                                               ;; LaTeX - pdfx
  "File extension which `treemacs-ignore-filter' will ensure are ignored"
  :safe #'string-list-p)

(defcustom treemacs-file-ignore-globs
  '("*/_minted-*"                                        ;; LaTeX
     "*/.auctex-auto" "*/_region_.log" "*/_region_.tex") ;; AucTeX
  "Globs which will are transformed to `treemacs-file-ignore-regexps'
which `treemacs-ignore-filter' will ensure are ignored"
  :safe #'string-list-p)
\end{verbatim}
\item Fringe only appears with width > 5
\label{sec:org4f3ff4b}
\begin{verbatim}
(setq doom-themes-treemacs-bitmap-indicator-width 8)
\end{verbatim}
\end{enumerate}

\subsection{Minor modes}
\label{sec:org276591d}
\subsubsection{Centaur-tabs\hfill{}\textsc{ARCHIVE}}
\label{sec:org12c1489}

\subsubsection{Elcord}
\label{sec:orgdaa57f9}

\begin{verbatim}
(package! elcord)
\end{verbatim}

\begin{verbatim}
(setq elcord-editor-icon "emacs_icon"
      elcord-display-elapsed nil
      elcord--editor-name "Emacs"
      elcord-use-major-mode-as-main-icon t)
\end{verbatim}

\subsubsection{@Evil}
\label{sec:orgcd1996c}
\begin{enumerate}
\item Variáveis
\label{sec:orgcbb7603}
\begin{verbatim}
(setq evil-shift-round nil
      evil-cross-lines t

      ;; Respeita linhas visuais
      evil-respect-visual-line-mode t

      ;; Substitui vários matches por linha no evil-ex
      evil-ex-substitute-global t)
\end{verbatim}

\item Shift
\label{sec:org94e564b}
