config.org
**** Shift
Eu /realmente/ quero que o shift tenha 2 espaços na linguagem elisp.
#+begin_src elisp :tangle tangle/minor/evil.el
;;; tangle/minor/evil.el -*- lexical-binding: t; -*-
(defadvice! ~evil-shift-width-elisp-advice (fun &rest r)
  :around #'evil-shift-width-elisp-advice
  (if (eq major-mode 'emacs-lisp-mode)
      (setq evil-shift-width 2)
    (apply fun r)))
#+end_src

**** Evil-mc

Multicursores com o Ctrl + clique esquerdo do mouse (como no VSCode).
#+begin_src elisp :tangle tangle/minor/evil.el
(defun evil-mc/toggle-cursor-on-click (event)
  "Add a cursor where you click, or remove a fake cursor that is
already there."
  (interactive "e")
  (mouse-minibuffer-check event)
  (require 'evil-mc)
  ;; Use event-end in case called from mouse-drag-region.
  ;; If EVENT is a click, event-end and event-start give same value.
  (let ((position (event-end event)))
    (if (not (windowp (posn-window position)))
        (error "Position not in text area of window"))
    (select-window (posn-window position))
    (let ((pt (posn-point position)))
      (if (numberp pt)
          ;; is there a fake cursor with the actual *point* right where we are?
          (unless (evil-mc-undo-cursor-at-pos pt)
            (save-excursion
              (goto-char pt)
              (evil-mc-make-cursor-here)))))))
(map! "C-<down-mouse-1>" nil)
(map! "C-<mouse-1>" #'evil-mc/toggle-cursor-on-click)
#+end_src

*** Flyspell

Vamos deixá-lo menos preguiçoso: @performance

#+begin_src emacs-lisp
(setq flyspell-lazy-idle-seconds 0.4)
#+end_src

Com o =flyspell-correct=, vamos adicionar alguns atalhos:

#+begin_src emacs-lisp
(map! :ni "C-." #'flyspell-correct-move)
#+end_src

*** Iedit

Desativa uma mensagem chata quando apertamos =M-d=

#+begin_src emacs-lisp
(setq iedit-toggle-key-default nil)
#+end_src

*** @Lisps
**** Parinfer

 - =paren= Mode gives you full control of parens, while Parinfer corrects
   indentation. You can still adjust indentation, but you won't be able to
   indent/dedent past certain boundaries set by parens on previous lines.
   
 - =indent= Mode gives you full control of indentation, while Parinfer
   corrects or inserts close-parens where appropriate. Specifically, it only
   touches the groups of close-parens at the end of each line.
   
 - =smart= Mode is like Indent Mode, but it tries to preserve the structure too.

#+begin_src emacs-lisp
(setq parinfer-rust-preferred-mode "indent")
#+end_src

*** Mamimo

#+begin_src emacs-lisp
(setq mamimo-greek-abbrevs-prefix "'")
(add-hook! 'mamimo-mode-hook
  (evil-tex-mode +1))
#+end_src

*** Mixed-pitch

#+begin_src emacs-lisp
(defface my-mixed-pitch-face
  '((t :family "Overpass" :weight semilight))
  "Face for `mixed-pitch-mode'")
(setq mixed-pitch-face 'my-mixed-pitch-face)
#+end_src

*** @Org
**** Org-appear

Faz os elementos de markup desaparecerem automaticamente.

#+begin_src emacs-lisp :tangle packages.el
(package! org-appear)
#+end_src

#+begin_src emacs-lisp
(use-package org-appear
  :hook (org-mode . org-appear-mode)
  :config
  (setq org-appear-autolinks nil))
#+end_src

*** Vertico :completion:

#+begin_src emacs-lisp :tangle tangle/minor/vertico.el
(vertico-reverse-mode +1)
(setq vertico-resize t
      vertico-count 8)
#+end_src

** Carregar
O trecho a seguir carrega os arquivos de configurações nos diretórios
=lisp/major= e =lisp/minor=, e faz com que cada arquivo seja carregado apenas
depois do módulo de mesmo nome ser carregado (com a função =after!=).
#+begin_src emacs-lisp
(dolist (type '(major minor features))
  (let ((folder (format "~/.doom.d/lisp/%s/" type)))
    (dolist (file (file-expand-wildcards (concat folder "*.el")))
      (let ((f (file-name-sans-extension (file-name-nondirectory file))))
        (eval `(after! ,(intern f) (load! ,f ,folder)))))))
#+end_src

#+begin_src emacs-lisp
(dolist (type '(major minor features))
  (let ((folder (format "%stangle/%s/" doom-private-dir type)))
    (dolist (file (file-expand-wildcards (concat folder "*.el")))
      (let ((f (file-name-sans-extension (file-name-nondirectory file))))
        (eval `(after! ,(intern f) (load! ,f ,folder)))))))
#+end_src

* Atalhos de teclado
** TODO Implementar o atalho =C-l= no insert state
** TODO Fazer o binding =SPC s I= abrir a sessão com narrowing


** Comandos familiares

Porque ninguém merece tantos atalhos diferentes.

#+begin_src emacs-lisp
(map! "C-S-s" 'isearch-forward)
(map! :egni "C-s" 'save-buffer)
(map! :egni "C-/" 'evilnc-comment-or-uncomment-lines)

(map! :i "C-v" 'yank)
(map! :i "C-z" 'evil-undo)
(map! :i "C-S-z" 'evil-redo)
(map! :i "C-x" 'evil-delete)
#+end_src

** Workspaces
#+begin_src emacs-lisp
(map! :map 'doom-leader-workspace-map
      "}" #'+workspace/swap-right
      "{" #'+workspace/swap-left)
#+end_src

** Evil ABNT :ARCHIVE:

Nossos teclados têm uma tecla a mais no melhor lugar possível, não podemos
desperdiçar a oportunidade de usar =jklç=:

#+begin_src emacs-lisp :tangle no
;; no dia em que eu precisar usar teclado americano, eu vou me arrepender...

(map! :map minibuffer-local-map
      "C-k" #'next-line
      "C-l" #'previous-line
      :i "C-k" #'next-line
      :i "C-l" #'previous-line)

(map! :map evil-motion-state-map
      "j" 'evil-backward-char
      "k" 'evil-next-visual-line
      "l" 'evil-previous-visual-line
      "ç" 'evil-forward-char)

(map! :map evil-window-map
      ;; Navigation
      "j"       #'evil-window-left
      "k"       #'evil-window-down
      "l"       #'evil-window-up
      "ç"       #'evil-window-right
      "C-j"     #'evil-window-left
      "C-k"     #'evil-window-down
      "C-l"     #'evil-window-up
      "C-ç"     #'evil-window-right
      ;; Swapping windows
      "J"       #'+evil/window-move-left
      "K"       #'+evil/window-move-down
      "L"       #'+evil/window-move-up
      "Ç"       #'+evil/window-move-right)

(map! :i "M-J" 'evil-backward-char
      :i "M-K" 'evil-next-line
      :i "M-L" 'evil-previous-line
      :i "M-Ç" 'evil-forward-char)

(after! treemacs (evil-define-key 'treemacs treemacs-mode-map "l" nil "h" nil))

;; (evil-define-key '(visual normal) Info-mode-map "l" nil)
(map! :map Info-mode-map :vn "l" nil)

(map! :after treemacs
      :map evil-treemacs-state-map
      "j"      #'treemacs-COLLAPSE-action
      "k"      #'treemacs-next-line
      "l"      #'treemacs-previous-line
      "ç"      #'treemacs-RET-action)
#+end_src

** TODO Hydras (mudar para hercules)
Uma história antiga.

Não gosto do estilo do pop up
#+begin_src emacs-lisp
(setq hydra-is-helpful nil)
#+end_src

Tamanho da janela
#+begin_src emacs-lisp
(defhydra window-height-hydra (evil-window-map)
  "window height"
  ("=" evil-window-increase-height "increase")
  ("-" evil-window-decrease-height "decrease"))
#+end_src

** Kitty (Terminal)
#+begin_src emacs-lisp
(map! :prefix-map ("\x80" . "kitty C map")
      :map 'key-translation-map
      "/" "C-/")

(map! :prefix-map ("\x81" . "kitty C-S map")
      :map 'key-translation-map
      "z" (kbd "C-S-z"))
#+end_src

** Edit leader key
#+begin_src emacs-lisp
(map! :leader
      :prefix ("e" . "edit")
      :desc "New snipet" "s" #'+snippets/new
      :desc "New alias" "a" #'+snippets/new-alias)

(map! :i "C-M-x" ctl-x-map)
#+end_src

** Centralizar ao procurar com o evil
#+begin_src emacs-lisp
;; (evil-define-motion search-previous-and-recenter (count)
;;   :jump t
;;   :type exclusive
;;   (evil-ex-search-previous count)
;;   (call-interactively #'evil-scroll-line-to-center))

;; (map! :n [remap evil-ex-search-previous] #'search-previous-and-recenter)
#+end_src

** Outros

#+begin_src emacs-lisp
(map! "M-j" 'drag-stuff-down
      "M-k" 'drag-stuff-up)

(map! :map lean-mode-map "M-." 'lean-find-definition)

(map! :map TeX-mode-map "C-S-s" 'TeX-command-run-all)
#+end_src
