config.tex
Eu \emph{realmente} quero que o shift tenha 2 espaços na linguagem elisp.
\begin{verbatim}
;;; tangle/minor/evil.el -*- lexical-binding: t; -*-
(defadvice! ~evil-shift-width-elisp-advice (fun &rest r)
  :around #'evil-shift-width-elisp-advice
  (if (eq major-mode 'emacs-lisp-mode)
      (setq evil-shift-width 2)
    (apply fun r)))
\end{verbatim}

\item Evil-mc
\label{sec:orgde0588d}

Multicursores com o Ctrl + clique esquerdo do mouse (como no VSCode).
\begin{verbatim}
(defun evil-mc/toggle-cursor-on-click (event)
  "Add a cursor where you click, or remove a fake cursor that is
already there."
  (interactive "e")
  (mouse-minibuffer-check event)
  (require 'evil-mc)
  ;; Use event-end in case called from mouse-drag-region.
  ;; If EVENT is a click, event-end and event-start give same value.
  (let ((position (event-end event)))
    (if (not (windowp (posn-window position)))
        (error "Position not in text area of window"))
    (select-window (posn-window position))
    (let ((pt (posn-point position)))
      (if (numberp pt)
          ;; is there a fake cursor with the actual *point* right where we are?
          (unless (evil-mc-undo-cursor-at-pos pt)
            (save-excursion
              (goto-char pt)
              (evil-mc-make-cursor-here)))))))
(map! "C-<down-mouse-1>" nil)
(map! "C-<mouse-1>" #'evil-mc/toggle-cursor-on-click)
\end{verbatim}
\end{enumerate}

\subsubsection{Flyspell}
\label{sec:org7c4e731}

Vamos deixá-lo menos preguiçoso: @performance

\begin{verbatim}
(setq flyspell-lazy-idle-seconds 0.4)
\end{verbatim}

Com o \texttt{flyspell-correct}, vamos adicionar alguns atalhos:

\begin{verbatim}
(map! :ni "C-." #'flyspell-correct-move)
\end{verbatim}

\subsubsection{Iedit}
\label{sec:orgf09ad0e}

Desativa uma mensagem chata quando apertamos \texttt{M-d}

\begin{verbatim}
(setq iedit-toggle-key-default nil)
\end{verbatim}

\subsubsection{@Lisps}
\label{sec:orgccb0e39}
\begin{enumerate}
\item Parinfer
\label{sec:orga914064}

\begin{itemize}
\item \texttt{paren} Mode gives you full control of parens, while Parinfer corrects
indentation. You can still adjust indentation, but you won't be able to
indent/dedent past certain boundaries set by parens on previous lines.

\item \texttt{indent} Mode gives you full control of indentation, while Parinfer
corrects or inserts close-parens where appropriate. Specifically, it only
touches the groups of close-parens at the end of each line.

\item \texttt{smart} Mode is like Indent Mode, but it tries to preserve the structure too.
\end{itemize}

\begin{verbatim}
(setq parinfer-rust-preferred-mode "indent")
\end{verbatim}
\end{enumerate}

\subsubsection{Mamimo}
\label{sec:org4902dab}

\begin{verbatim}
(setq mamimo-greek-abbrevs-prefix "'")
(add-hook! 'mamimo-mode-hook
  (evil-tex-mode +1))
\end{verbatim}

\subsubsection{Mixed-pitch}
\label{sec:orgb5b9b2e}

\begin{verbatim}
(defface my-mixed-pitch-face
  '((t :family "Overpass" :weight light))
  "Face for `mixed-pitch-mode'")
(setq mixed-pitch-face 'my-mixed-pitch-face
      mixed-pitch-set-height nil)
\end{verbatim}

\subsubsection{@Org}
\label{sec:orge433c41}
\begin{enumerate}
\item Org-appear
\label{sec:org2109952}

Faz os elementos de markup desaparecerem automaticamente.

\begin{verbatim}
(package! org-appear)
\end{verbatim}

\begin{verbatim}
(use-package org-appear
  :hook (org-mode . org-appear-mode)
  :config
  (setq org-appear-autolinks nil))
\end{verbatim}
\end{enumerate}

\subsubsection{Vertico\hfill{}\textsc{completion}}
\label{sec:orgaf65f9f}

\begin{verbatim}
(vertico-reverse-mode +1)
(setq vertico-resize t
      vertico-count 8)
\end{verbatim}

\subsection{Carregar}
\label{sec:org3e6c555}
O trecho a seguir carrega os arquivos de configurações nos diretórios
\texttt{lisp/major} e \texttt{lisp/minor}, e faz com que cada arquivo seja carregado apenas
depois do módulo de mesmo nome ser carregado (com a função \texttt{after!}).
\begin{verbatim}
(dolist (type '(major minor features))
  (let ((folder (format "~/.doom.d/lisp/%s/" type)))
    (dolist (file (file-expand-wildcards (concat folder "*.el")))
      (let ((f (file-name-sans-extension (file-name-nondirectory file))))
        (eval `(after! ,(intern f) (load! ,f ,folder)))))))
\end{verbatim}

\begin{verbatim}
(dolist (type '(major minor features))
  (let ((folder (format "%stangle/%s/" doom-private-dir type)))
    (dolist (file (file-expand-wildcards (concat folder "*.el")))
      (let ((f (file-name-sans-extension (file-name-nondirectory file))))
        (eval `(after! ,(intern f) (load! ,f ,folder)))))))
\end{verbatim}

\section{Atalhos de teclado}
\label{sec:orga0eb357}
\subsection{{\bfseries\sffamily TODO} Implementar o atalho \texttt{C-l} no insert state}
\label{sec:orgff3161d}
\subsection{{\bfseries\sffamily TODO} Fazer o binding \texttt{SPC s I} abrir a sessão com narrowing}
\label{sec:org5db83d0}


\subsection{Comandos familiares}
\label{sec:orgf0ce997}

Porque ninguém merece tantos atalhos diferentes.

\begin{verbatim}
(map! "C-S-s" 'isearch-forward)
(map! :egni "C-s" 'save-buffer)
(map! :egni "C-/" 'evilnc-comment-or-uncomment-lines)

(map! :i "C-v" 'yank)
(map! :i "C-z" 'evil-undo)
(map! :i "C-S-z" 'evil-redo)
(map! :i "C-x" 'evil-delete)
\end{verbatim}

\subsection{Workspaces}
\label{sec:org7516ae1}
\begin{verbatim}
(map! :map 'doom-leader-workspace-map
      "}" #'+workspace/swap-right
      "{" #'+workspace/swap-left)
\end{verbatim}

\subsection{Evil ABNT\hfill{}\textsc{ARCHIVE}}
\label{sec:org7ab3ce3}

\subsection{{\bfseries\sffamily TODO} Hydras (mudar para hercules)}
\label{sec:org66ae87d}
Uma história antiga.

Não gosto do estilo do pop up
\begin{verbatim}
(setq hydra-is-helpful nil)
\end{verbatim}

Tamanho da janela
\begin{verbatim}
(defhydra window-height-hydra (evil-window-map)
  "window height"
  ("=" evil-window-increase-height "increase")
  ("-" evil-window-decrease-height "decrease"))
\end{verbatim}

\subsection{Kitty (Terminal)}
\label{sec:orga8af5e9}
\begin{verbatim}
(map! :prefix-map ("\x80" . "kitty C map")
      :map 'key-translation-map
      "/" "C-/")

(map! :prefix-map ("\x81" . "kitty C-S map")
      :map 'key-translation-map
      "z" (kbd "C-S-z"))
\end{verbatim}

\subsection{Edit leader key}
\label{sec:org101fd72}
\begin{verbatim}
(map! :leader
      :prefix ("e" . "edit")
      :desc "New snipet" "s" #'+snippets/new
      :desc "New alias" "a" #'+snippets/new-alias)

(map! :i "C-M-x" ctl-x-map)
\end{verbatim}

\subsection{Centralizar ao procurar com o evil}
\label{sec:org7e7e23a}
\begin{verbatim}
;; (evil-define-motion search-previous-and-recenter (count)
;;   :jump t
;;   :type exclusive
;;   (evil-ex-search-previous count)
;;   (call-interactively #'evil-scroll-line-to-center))

;; (map! :n [remap evil-ex-search-previous] #'search-previous-and-recenter)
\end{verbatim}

\subsection{Outros}
\label{sec:orgd66ba59}

\begin{verbatim}
(map! "M-j" 'drag-stuff-down
      "M-k" 'drag-stuff-up)

(map! :map lean-mode-map "M-." 'lean-find-definition)

(map! :map TeX-mode-map "C-S-s" 'TeX-command-run-all)
\end{verbatim}
\end{document}
